app/controllers/artists_controller.rb

SELECT "artists".* FROM "artists"
---
  def index
    if params[:song_id]
    @artists = Artist.all